app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 11 Oct 2012 07:01:02 UTC +00:00], ["email", "oogabooga"], ["password", "asdf"], ["updated_at", Thu, 11 Oct 2012 07:01:02 UTC +00:00]]